app/views/admin/third.html.erb

	 	<form action = "/admin/forth" method = "post" >
		Choose department...
		<%= select_tag("service", options_for_select(@service.collect{|service|service.name}))%><br><br><br><br>
---
SELECT `services`.* FROM `services`