app/controllers/admin_controller.rb

	def third
		 @service =Service.all.delete_if{|service|service.name.blank?}
---
SELECT `services`.* FROM `services`

	def forth
		@votes = Vote.all
		@satlevel = Satlevel.all
		@concerns = Concern.all
---
SELECT `votes`.* FROM `votes`
SELECT `satlevels`.* FROM `satlevels` WHERE `satlevels`.`satlevels_id` = 1
SELECT `concerns`.* FROM `concerns`

	def listservice
		@service = Service.all
---
SELECT `services`.* FROM `services`