app/controllers/admin_controller.rb

SELECT `satlevels`.* FROM `satlevels` INNER JOIN `votes` ON `votes`.`satlevel_id` = `satlevels`.`satlevel_id`
SELECT `concerns`.* FROM `concerns` INNER JOIN `vote_concerns` ON `vote_concerns`.`concern_id` = `concerns`.`concern_id`
---
	def forth
		@votes = Vote.all
		@satlevel = Satlevel.all



		@result = Satlevel.joins(:votes)
		@result2 = @result.find_by_sql("select name, date, count(*) as 'total_votes' from satlevels left join votes on
 						satlevels.satlevel_id = votes.satlevel_id group by satlevels.satlevel_id ")


		@concern = Concern.joins(:vote_concerns)