app/controllers/votes_controller.rb

	def serviceselect

	   @service =Service.all.delete_if{|service|service.name.blank?}
---
SELECT `services`.* FROM `services`

	def checksat

		@hash_id = params[:client_id]
		@service_selected = params[:service]
		@sat = Satlevel.all.delete_if{|sat|sat.name.blank?}
---
SELECT `satlevels`.* FROM `satlevels`

	def concerns
	    	@service = params[:service_choice]
      		@concerns = Concern.all
---
SELECT `concerns`.* FROM `concerns`

	def save_vote

		vote = Vote.new
       		vote.client_id   = params[:client_id]
		vote.satlevel_id = Satlevel.find_by_name(params[:response]).id
		vote.service_id  = Service.find_by_name(params[:service_choice]).id

		if vote.save


			if !(params[:concerns].nil?)

				concern= params[:concerns]
				concern.each do |f|
				vote_concern 	        = VoteConcern.new
				vote_concern.vote_id    = Vote.last.id
				vote_concern.concern_id = Concern.find_by_name(f).id
				vote_concern.save
---
SELECT `satlevels`.* FROM `satlevels` WHERE `satlevels`.`name` = 'ATLEAST SATISFIED' LIMIT 1
SELECT `services`.* FROM `services` WHERE `services`.`name` = 'OPD' LIMIT 1
INSERT INTO `votes` (`client_id`, `satlevel_id`, `service_id`, `date`, `created_at`, `updated_at`) VALUES ('de06109890d26a134f724246c64e1c553881974a', 3, 1, '2014-05-25', '2014-05-25 07:04:20', '2014-05-25 07:04:20')
SELECT `concerns`.* FROM `concerns`
SELECT `votes`.* FROM `votes` ORDER BY votes.vote_id DESC LIMIT 1
SELECT `concerns`.* FROM `concerns` WHERE `concerns`.`name` = 'Harsh Attitude Nurses' LIMIT 1
INSERT INTO `vote_concerns` (`vote_id`, `concern_id`, `created_at`, `updated_at`) VALUES (20, 3, '2014-04-18 16:51:21', '2014-04-18 16:51:21')

	def save_comment

		serv = $service
		if !(params[:comment].nil?)

			new_comment = Comment.new
			new_comment.service_id = Service.find_by_name(serv).id
			new_comment.comment =  params[:comment]
			new_comment.save
---
SELECT `services`.* FROM `services` WHERE `services`.`name` IS NULL LIMIT 1
INSERT INTO `comments` (`service_id`, `comment`, `created_at`, `updated_at`) VALUES (1, 'add more beds', '2014-05-13 21:58:33', '2014-05-13 21:58:33')